In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.set_option('precision', 1)

In [3]:
books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

In [4]:
user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

In [5]:
dat = {'Book Title' : books,
       'Author' : authors,
       'User 1' : user_1,
       'User 2' : user_2,
       'User 3' : user_3,
       'User 4' : user_4}

In [6]:
print(dat)

{'Book Title': 0     Great Expectations
1        Of Mice and Men
2       Romeo and Juliet
3       The Time Machine
4    Alice in Wonderland
dtype: object, 'Author': 0        Charles Dickens
1         John Steinbeck
2    William Shakespeare
3            H. G. Wells
4          Lewis Carroll
dtype: object, 'User 1': 0    3.2
1    NaN
2    2.5
dtype: float64, 'User 2': 0    5.0
1    1.3
2    4.0
3    3.8
dtype: float64, 'User 3': 0    2.0
1    2.3
2    NaN
3    4.0
dtype: float64, 'User 4': 0    4.0
1    3.5
2    4.0
3    5.0
4    4.2
dtype: float64}

In [7]:
book_ratings = pd.DataFrame(dat)

In [8]:
book_ratings

                Author           Book Title  User 1  User 2  User 3  User 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     NaN     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     NaN     4.0
3          H. G. Wells     The Time Machine     NaN     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     NaN     NaN     NaN     4.2

In [10]:
book_ratings.fillna(book_ratings.mean(), inplace=True)

                Author           Book Title  User 1  User 2  User 3  User 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     2.9     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     2.8     4.0
3          H. G. Wells     The Time Machine     2.9     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     2.9     3.5     2.8     4.2